emacs/admin.org
* ELPA

#+begin_src emacs-lisp :tangle "init-elpa.el"
  (defvar starter-kit-packages (list
                                'auto-complete
                                'autopair
                                'browse-kill-ring
                                'css-mode
                                'exec-path-from-shell
                                'expand-region
                                'hl-line+
                                'latex-pretty-symbols
                                ;; 'mac-key-mode
                                'magit
                                'markdown-mode
                                'maxframe
                                'multiple-cursors
                                'pandoc-mode
                                'python-mode
                                'ipython
                                'jedi
                                'redo+
                                'ruby-mode
                                's
                                'smex
                                'typopunct
                                'yaml-mode
                                'yasnippet
                                'auctex
                                'r-autoyas
                                )
    "Libraries that should be installed by default.")

    (setq package-archives '(("org"       . "http://orgmode.org/elpa/")
                             ("gnu"       . "http://elpa.gnu.org/packages/")
                             ("melpa"     . "http://melpa.milkbox.net/packages/")
                             ("tromey"    . "http://tromey.com/elpa/")
                             ("marmalade" . "http://marmalade-repo.org/packages/")))

(defun starter-kit-elpa-install ()
  "Install all starter-kit packages that aren't installed."
  (interactive)
  (dolist (package starter-kit-packages)
    (unless (or (member package package-activated-list)
                (functionp package))
      (message "Installing %s" (symbol-name package))
      (package-install package))))

(defun esk-online? ()
  "See if we're online.

Windows does not have the network-interface-list function, so we
just have to assume it's online."
  ;; TODO how could this work on Windows?
  (if (and (functionp 'network-interface-list)
           (network-interface-list))
      (some (lambda (iface) (unless (equal "lo" (car iface))
                         (member 'up (first (last (network-interface-info
                                                   (car iface)))))))
            (network-interface-list))
    t))

;On your first run, this should pull in all the base packages.

(when (esk-online?)
  (unless package-archive-contents (package-refresh-contents))
  (starter-kit-elpa-install))

;Make sure the PATH variable is set properly. (Uses exec-path-from-shell package.)
  (when (memq window-system '(mac ns))
  (exec-path-from-shell-initialize))

#+end_src

* Evil-mode
#+BEGIN_SRC emacs-lisp :tangle "init-evil.el"

  (evil-mode 1)

  ;; don't use evil in the following mode
  (mapc (lambda (mode) (evil-set-initial-state mode 'emacs))
       '(inferior-emacs-lisp-mode
         comint-mode
         compilation-mode
         shell-mode
         eshell-mode
         inferior-python-mode
         inferior-ess-mode
         dired-mode
         term-mode
         deft-mode
         nrepl-mode
         nrepl-repl-mode
         cider-repl-mode
         skewer-repl-mode
         makey-key-mode
         project-explorer-mode
         process-menu-mode
         prodigy-mode
         git-rebase-mode
         Custom-mode
         pycscope-list-entry-mode
         magit-branch-manager-mode))


  ; evil leader mode
  ;(global-evil-leader-mode)

  ; (evil-leader/set-leader "<space>")
  ; (setq evil-leader/in-all-states t)

  (setq evil-want-C-u-scroll t
        evil-cross-lines t
        evil-move-cursor-back nil)

  (defmacro bind (&rest commands)
    "Convience macro which creates a lambda interactive command."
    `(lambda () (interactive) ,@commands))

  (defmacro after (feature &rest body)
    "After FEATURE is loaded, evaluate BODY."
    (declare (indent defun))
    `(eval-after-load ,feature
       '(progn ,@body)))

  (defun nmap (kbinding fun) (define-key evil-normal-state-map kbinding fun))
  (defun vmap (kbinding fun) (define-key evil-visual-state-map kbinding fun))
  (defun imap (kbinding fun) (define-key evil-insert-state-map kbinding fun))
  (defun nvmap (kbinding fun) (progn (nmap kbinding fun) (vmap kbinding fun)))

  (nmap (kbd "C-u")         'evil-scroll-up)
  (nmap (kbd "<RET>")       'evil-scroll-down)
  (nmap (kbd "<backspace>") 'evil-scroll-up)
  (nmap (kbd "`")           'universal-argument)

  ; (global-set-key "\\" 'evil-execute-in-normal-state)

  (defun kill-current-buffer ()
    (interactive)
    (kill-buffer (current-buffer)))

  (defun start-shell ()
     (interactive)
     (ansi-term explicit-shell-file-name))

  ; (define-key evil-normal-state-map ":l" 'cycle-buffer)

  (nmap " k" 'helm-bookmarks)
  (nmap " p" 'helm-browse-project)
  (nmap " g" 'helm-buffers-list)
  (nmap " T" 'helm-etags-select)
  (nmap " f" 'helm-mini)
  (nmap " h" 'highlight-regexp)
  (nmap " H" 'highlight-from-isearch)
  (nmap " u" 'unhighlight-regexp)
  (nmap " j" 'dired-jump)
  (nmap " n" 'linum-mode)
  (nmap " O" 'helm-browse-code)
  (nmap " o" 'idomenu) ;tags
  ;(nmap " O" 'helm-org-headlines)
  (nmap " /" 'helm-swoop)
  (nmap " A" 'ag)
  (nmap " a" 'ag-here-from-point)
  (nmap " e" 'helm-find-files)
  (nmap " i" 'deft)
  (nmap "  " 'ido-switch-buffer)
  (nmap " ll" 'align-regexp)
  (nmap " LL" 'align-cljlet)
  (nmap " q" 'multi-term)
  (nmap "gu" 'browse-url)
  (vmap "gu" 'google-region)
  (nmap "Q" 'kill-current-buffer)
  (global-set-key (kbd "C-S-k") 'kill-current-buffer)
  (nmap "q" 'delete-window)

  ;(nvmap " vf" 'mark-defun)

  (nmap " yf" 'copy-filename-of-current-buffer)
  (nmap " yp" 'copy-full-path-of-current-buffer)

  (nmap (kbd "SPC RET") 'ido-find-file)
  (nmap (kbd "SPC TAB") 'ibuffer-other-window)

  (nmap "j" 'evil-next-visual-line)
  (nmap "k" 'evil-previous-visual-line)
  (nvmap "H" 'evil-first-non-blank)
  (nvmap "L" 'evil-last-non-blank)

  (nmap (kbd "C-f") 'evil-find-char-backward)

  (nmap (kbd "[ RET") (bind (evil-insert-newline-above) (forward-line)))
  (nmap (kbd "] RET") (bind (evil-insert-newline-below) (forward-line -1)))
  (nmap (kbd "[ SPC") (bind (evil-insert -1) (insert " ") (evil-normal-state)))
  (nmap (kbd "] SPC") (bind (evil-append   1) (insert " ") (evil-backward-char 2) (evil-normal-state)))
  ; (nmap (kbd "C-w") 'subword-backward-kill)
  (nmap (kbd "M-<backspace>") 'delete-till-nonblank-char)
  (nmap (kbd "[ e") (kbd "ddkP"))
  (nmap (kbd "] e") (kbd "ddp"))
  (nmap (kbd "[ b") 'previous-buffer)
  (nmap (kbd "] b") 'next-buffer)
  (nmap (kbd "[ q") 'previous-error)
  (nmap (kbd "] q") 'next-error)

#+END_SRC
* IBuffer
#+BEGIN_SRC emacs-lisp :tangle "init-ibuffer.el"

  (require 'ibuffer)

  (define-key ibuffer-mode-map "K" 'ibuffer-do-delete)
  (define-key ibuffer-mode-map "j" 'ibuffer-forward-line)
  (define-key ibuffer-mode-map "k" 'ibuffer-backward-line)
  (define-key ibuffer-mode-map "f" 'ibuffer-jump-to-buffer)

  (nmap ",," 'evil-buffer)

;; default grouping of ibuffer
(setq ibuffer-saved-filter-groups
      (quote (("default"
               ("10to8" (filename . "10to8"))
               ("org" (mode . org-mode))
               ("dirs" (mode . dired-mode))
               ("python" (mode . python-mode))
               ("git" (or
                        (mode . magit-status-mode)
                        (mode . magit-diff-mode)))
               ("js" (or
                        (mode . js2-mode)
                        (mode . js3-mode)
                        (mode . coffee-mode)))
               ("clojure" (or
                        (mode . clojure-mode)
                        (mode . cider-repl-mode)))
               ("doc" (or
                        (mode . markdown-mode)
                        (mode . text-mode)))
               ("templates" (or
                              (mode . web-mode)
                              (mode . jade-mode)
                              (mode . css-mode)
                              (mode . less-mode)
                              (mode . style-mode)))
               ("emacs" (or
                         (name . "^.+\\.el$")
                         (name . "^\\*.+\\*$")))))))

 (add-hook 'ibuffer-mode-hook
            (lambda ()
              (ibuffer-switch-to-saved-filter-groups "default")))

;; don't ask to kill buffers
(setq ibuffer-expert t)

#+END_SRC

* Smartparens
#+BEGIN_SRC emacs-lisp :tangle "init-smartparens.el"

  (require 'smartparens-config)
  (smartparens-global-mode t)
  (show-smartparens-global-mode t)

  (defun sp-wrap-next-sexp ()
    (interactive)
    (progn (insert "()")
           (evil-backward-char 1)
           (sp-forward-slurp-sexp)
           (evil-insert 1)))

  (define-key sp-keymap (kbd "C-M-n") 'sp-down-sexp)
  (define-key sp-keymap (kbd "C-M-p") 'sp-backward-up-sexp)
  (define-key sp-keymap (kbd "C-M-j") 'sp-next-sexp)
  (define-key sp-keymap (kbd "C-M-k") 'sp-backward-sexp)
  (define-key sp-keymap (kbd "C-M-l") 'sp-forward-symbol)
  (define-key sp-keymap (kbd "C-M-h") 'sp-backward-symbol)
  (define-key sp-keymap (kbd "C-M-a") 'sp-beginning-of-sexp)
  (define-key sp-keymap (kbd "C-M-e") 'sp-end-of-sexp)
  (define-key sp-keymap (kbd "C-M-w") 'sp-wrap-next-sexp)
  (define-key sp-keymap (kbd "C-M-t") 'sp-transpose-sexp)
  (define-key sp-keymap (kbd "C-M-n") 'sp-next-sexp)
  (define-key sp-keymap (kbd "C-M-p") 'sp-previous-sexp)
  (define-key sp-keymap (kbd "C-M-<backspace>") 'sp-kill-sexp)
  (define-key sp-keymap (kbd "C-~") 'sp-kill-symbol)
  (define-key sp-keymap (kbd "C-M-y") 'sp-copy-sexp)
  (define-key sp-keymap (kbd "C-M-<right>") 'sp-forward-slurp-sexp)
  (define-key sp-keymap (kbd "C-M-<left>") 'sp-backward-slurp-sexp)
  (define-key sp-keymap (kbd "C-<left>") 'sp-forward-barf-sexp)
  (define-key sp-keymap (kbd "C-<right>") 'sp-backward-barf-sexp)
  (define-key sp-keymap (kbd "C-M-<up>") 'sp-splice-sexp-killing-around)
  (define-key sp-keymap (kbd "C-M-<down>") 'sp-splice-sexp-killing-forward)
  ;(define-key sp-keymap (kbd "C-M-<backspace>") 'sp-splice-sexp-killing-backward)
  ;(define-key sp-keymap (kbd "C-S-<backspace>") 'sp-splice-sexp-killing-around)

  (define-key sp-keymap (kbd "C-M-s j") 'sp-join-sexp)
  (define-key sp-keymap (kbd "C-M-s s") 'sp-split-sexp)

  (define-key sp-keymap (kbd "C-M-]") 'sp-select-next-thing)
  (define-key sp-keymap (kbd "C-M-=") 'sp-indent-defun)

  ;;;;;;;;;;;;;;;;;;
  ;; pair management

  (sp-local-pair 'minibuffer-inactive-mode "'" nil :actions nil)

  ;;; markdown-mode
  (sp-with-modes '(markdown-mode gfm-mode rst-mode)
    (sp-local-pair "*" "*" :bind "C-*")
    (sp-local-tag "2" "**" "**")
    (sp-local-tag "s" "```scheme" "```")
    (sp-local-tag "<"  "<_>" "</_>" :transform 'sp-match-sgml-tags))

  ;;; tex-mode latex-mode
  (sp-with-modes '(tex-mode plain-tex-mode latex-mode)
    (sp-local-tag "i" "1d5f8e69396c521f645375107197ea4dfbc7b792quot;<" "1d5f8e69396c521f645375107197ea4dfbc7b792quot;>"))

  ;;; html-mode
  (sp-with-modes '(html-mode sgml-mode)
    (sp-local-pair "<" ">"))

  ;;; lisp modes
  (sp-with-modes sp--lisp-modes
    (sp-local-pair "(" nil :bind "C-("))

#+END_SRC

